<!DOCTYPE html>
<html lang="ru">
<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<link rel="stylesheet" type="text/css" href="css/style.css" />
	<title>Сёрфинг сайтов</title>
</head>
<body>
	<header>
		<p class="logo position_logo">СЁРФИНГ <span>САЙТОВ</span></p>
	</header>
	<div class="container">
		<div class="site_list">
			<p class="search">ctrl+f <span>- для поиска</span></p>
			<div class="title_description_scroll">
				<div class="content_title_description">
					<div class="circle"><span>1</span></div>
					<div class="url">
						<a href="https://vk.com" target="_blank">https://vk.com</a>
						<div class="description">
							Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часов
							Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовобмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часов
						</div>
					</div>
				</div>
				<div class="content_title_description">
					<div class="circle"><span>1</span></div>
					<div class="url">
						<a href="https://vk.com" target="_blank">https://vk.com</a>
						<div class="description">
							Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часов
							Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовобмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часов
						</div>
					</div>
				</div>
				<div class="content_title_description">
					<div class="circle"><span>1</span></div>
					<div class="url">
						<a href="https://vk.com" target="_blank">https://vk.com</a>
						<div class="description">
							Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часов
							Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовобмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часов
						</div>
					</div>
				</div>
				<div class="content_title_description">
					<div class="circle"><span>1</span></div>
					<div class="url">
						<a href="https://vk.com" target="_blank">https://vk.com</a>
						<div class="description">
							Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часов
							Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовобмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часов
						</div>
					</div>
				</div>
				<div class="content_title_description">
					<div class="circle"><span>1</span></div>
					<div class="url">
						<a href="https://vk.com" target="_blank">https://vk.com</a>
						<div class="description">
							Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часов
							Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовобмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часовАвтоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часов
						</div>
					</div>
				</div>
			</div>
		</div>
	</div>
	<div class="conteiner_advertising_banner">
		<div class="advertising_banner">
			<div class="banner">
			</div>	
		</div>
	</div>
	<div class="container">
		<div class="payment_description">
			<div class="add_site">
				<div class="title_add_site position_add_site">Добавление сайта</div>
				<div class="enter_infromation">
					<p>Ссылка на сайт</p>
					<input placeholder="Введите ссылку" class="first">
				</div>
				<div class="enter_infromation enter_information_last_child">
					<p>Описание сайта</p>
					<textarea placeholder="Введите описание" class="last"></textarea>
				</div>
				<button class="submit_inf">ОПЛАТИТЬ <span>10 руб</span></button>
			</div>
			<div class="site_description">
				<div class="magazine position_descrip">Автоматическая система - которая позволяет добавлять ваш сайт в 77 сайтов систем обмена визитами в разделе сёрфинг в течении 48 часов</div>
				<hr>
				<div class="periodicity position_descrip">Периодичность добавления 20-30 минут - как только вы оплатите ваш сайт будет стоять 2 дня, на той позиции которую вы заняли - добавление в порядке очереди</div><hr>
				<div class="payment position_descrip">Стоимость: 10 рублей     Длительность: 2 дня 1 час Как только ваш сайт покинет сёрфинг наша система удалит ваш сайт из вашей позиции</div>		
			</div>
		</div>
	</div>
	<footer>
		<div class="container_footer">
			<p class="logo position_logo_footer">СЁРФИНГ <span>САЙТОВ</span></p>
			<a href="vk.com" class="footer_links">sharpsss</a>
			<a href="vk.com" class="footer_links">sharpsss</a>
			<a href="vk.com" class="footer_links">sharpsss</a>
			<a href="vk.com" class="footer_links">sharpsss</a>
			<a href="vk.com" class="footer_links">sharpsss</a>
		</div>
	</footer>
	<script>
		let container = document.querySelectorAll('.description');
		for (let i = 0; i < container.length; i++) {       
			let startY;
			let startX;
			let scrollLeft;
			let scrollTop;
			let isDown;
			container[i].addEventListener('mousedown',e => mouseIsDown(e));  
			container[i].addEventListener('mouseup',e => mouseUp(e))
			container[i].addEventListener('mouseleave',e=>mouseLeave(e));
			container[i].addEventListener('mousemove',e=>mouseMove(e));
			function mouseIsDown(e){
				isDown = true;
				startY = e.pageY - container[i].offsetTop;
				startX = e.pageX - container[i].offsetLeft;
				scrollLeft = container[i].scrollLeft;
				scrollTop = container[i].scrollTop; 
			}
			function mouseUp(e){
				isDown = false;
			}
			function mouseLeave(e){
				isDown = false;
			}
			function mouseMove(e){
				if(isDown){
					e.preventDefault();
    //Move vertcally
    const y = e.pageY - container[i].offsetTop;
    const walkY = y - startY;
    container[i].scrollTop = scrollTop - walkY;

    //Move Horizontally
    const x = e.pageX - container[i].offsetLeft;
    const walkX = x - startX;
    container[i].scrollLeft = scrollLeft - walkX;

  }
}
}
</script>
</body>
</html>